Network work group                                            Mach Chen 
Internet Draft                                             Renhai Zhang 
Expires: August 2008                        Huawei Technologies Co.,Ltd 
Category: Standards Track                                 Xiaodong Duan 
                                                           China Mobile 
                                                       February 3, 2008 
                                    
                                      
    ISIS Extensions in Support of Inter-AS Multiprotocol Label Switching 
          (MPLS) and Generalized MPLS (GMPLS) Traffic Engineering 
             draft-ietf-ccamp-isis-interas-te-extension-00.txt 


Status of this Memo 

   By submitting this Internet-Draft, each author represents that       
   any applicable patent or other IPR claims of which he or she is       
   aware have been or will be disclosed, and any of which he or she       
   becomes aware will be disclosed, in accordance with Section 6 of       
   BCP 79. 

   Internet-Drafts are working documents of the Internet Engineering 
   Task Force (IETF), its areas, and its working groups. Note that other 
   groups may also distribute working documents as Internet-Drafts. 

   Internet-Drafts are draft documents valid for a maximum of six months 
   and may be updated, replaced, or obsoleted by other documents at any 
   time.  It is inappropriate to use Internet-Drafts as reference 
   material or to cite them other than as "work in progress." 

   The list of current Internet-Drafts can be accessed at 
        http://www.ietf.org/ietf/1id-abstracts.txt 

   The list of Internet-Draft Shadow Directories can be accessed at 
        http://www.ietf.org/shadow.html 

   This Internet-Draft will expire on August 3, 2008. 

Abstract 

   This document describes extensions to the ISIS (ISIS) protocol to 
   support Multiprotocol Label Switching (MPLS) and Generalized MPLS 
   (GMPLS) Traffic Engineering (TE) for multiple Autonomous Systems 
   (ASes). It defines ISIS-TE extensions for the flooding of TE 
   information about inter-AS links which can be used to perform inter-
   AS TE path computation. 


 
 
 
Mach & Renhai          Expires August 3, 2008                 [Page 1] 

Internet-Draft     ISIS extensions for Inter-AS TE       February 2008 
    

   No support for flooding TE information from other outside the AS is 
   proposed or defined in this document. 

Conventions used in this document 

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", 
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this 
   document are to be interpreted as described in RFC-2119 [RFC2119]. 

Table of Contents 

    
   1. Introduction.................................................2 
   2. Problem Statement............................................3 
      2.1. A Note on Non-Objectives................................4 
      2.2. Per-Domain Path Determination...........................4 
      2.3. Backward Recursive Path Computation.....................6 
   3. Extensions to ISIS-TE........................................7 
      3.1. Inter-AS Reachability TLV...............................8 
      3.2. TE Router ID............................................9 
      3.3. Sub-TLV Detail.........................................10 
         3.3.1. Remote AS Number Sub-TLV..........................10 
         3.3.2. IPv4 Remote ASBR ID Sub-TLV.......................10 
         3.3.3. IPv6 Remote ASBR ID Sub-TLV.......................11 
         3.3.4. IPv4 TE Router ID sub-TLV.........................12 
         3.3.5. IPv6 TE Router ID sub-TLV.........................12 
   4. Procedure for Inter-AS TE Links.............................13 
      4.1. Origin of Proxied TE Information.......................14 
   5. Security Considerations.....................................14 
   6. IANA Considerations.........................................15 
      6.1. Inter-AS Reachability TLV..............................15 
      6.2. Sub-TLVs for the Inter-AS Reachability TLV.............15 
      6.3. Sub-TLVs for the IS-IS Router Capability TLV...........16 
   7. Acknowledgments.............................................16 
   8. References..................................................16 
      8.1. Normative References...................................16 
      8.2. Informative References.................................17 
   Authors' Addresses.............................................18 
   Intellectual Property Statement................................18 
   Disclaimer of Validity.........................................19 
   Copyright Statement............................................19 
    
1. Introduction 

   [ISIS-TE] defines extensions to the ISIS protocol [ISIS] to support 
   intra-area Traffic Engineering (TE). The extensions provide a way of 
   encoding the TE information for TE-enabled links within the network 
 
 
Mach, et al.           Expires August 3, 2008                 [Page 2] 

Internet-Draft     ISIS extensions for Inter-AS TE       February 2008 
    

   (TE links) and flooding this information within an area. The Extended 
   IS Reachability TLV and Traffic Engineering Router ID TLV, which are 
   defined in [ISIS-TE], are used to carry such TE information. The 
   Extended IS Reachability TLV has several nested sub-TLVs which 
   describe the TE attributes for a TE link.  

   [ISIS-TE-V3] and [GMPLS-TE] define similar extensions to ISIS [ISIS] 
   in support of IPv6 and GMPLS traffic engineering respectively. 

   Requirements for establishing Multiprotocol Label Switching (MPLS) TE 
   Label Switched Paths (LSPs) that cross multiple Autonomous Systems 
   (ASes) are described in [INTER-AS-TE-REQ]. As described in [INTER-AS-
   TE-REQ], a method SHOULD provide the ability to compute a path 
   spanning multiple ASes. So a path computation entity that may be the 
   head-end Label Switching Router (LSR), an AS Border Router (ASBR), or 
   a Path Computation Element (PCE [PCE]) needs to know the TE 
   information not only of the links within an AS, but also of the links 
   that connect to other ASes. 

   In this document, a new TLV, which is referred to as the Inter-AS 
   Reachability TLV, is defined to advertise inter-AS TE information, 
   three new sub-TLVs are defined for inclusion in the Inter-AS 
   Reachability TLV to carry the information about the remote AS number 
   and remote ASBR ID. The sub-TLVs defined in [ISIS-TE], [ISIS-TE-V3] 
   and other documents for inclusion in the Extended IS Reachability TLV 
   for describing the TE properties of a TE link are applicable to be 
   included in the Inter-AS Reachability TLV for describing the TE 
   properties of an inter-AS TE link as well. And two more new sub-TLVs 
   are defined for inclusion in the IS-IS Router Capability TLV to carry 
   the TE Router ID when TE Router ID needs to reach all routers within 
   an entire ISIS routing domain. The extensions are equally applicable 
   to IPv4 and IPv6 as identical extensions to [ISIS-TE] and [ISIS-TE-
   V3]. The detailed definitions and procedures are discussed in the 
   following sections. 

   This document does not propose or define any mechanisms to advertise 
   any other extra-AS TE information within ISIS. See Section 2.1 for a 
   full list of non-objectives for this work. 

2. Problem Statement 

   As described in [INTER-AS-TE-REQ], in the case of establishing an 
   inter-AS TE LSP traversing multiple ASes, the Path message [RFC3209] 
   may include the following elements in the Explicit Route Object (ERO) 
   in order to describe the path of the LSP: 

     - a set of AS numbers as loose hops; and/or 
 
 
Mach, et al.           Expires August 3, 2008                 [Page 3] 

Internet-Draft     ISIS extensions for Inter-AS TE       February 2008 
    

     - a set of LSRs including ASBRs as loose hops. 

   Two methods for determining inter-AS paths are currently being 
   discussed. The per-domain method [PD-PATH] determines the path one 
   domain at a time. The backward recursive method [BRPC] uses 
   cooperation between PCEs to determine an optimum inter-domain path. 
   The sections that follow examine how inter-AS TE link information 
   could be useful in both cases. 

2.1. A Note on Non-Objectives 

   It is important to note that this document does not make any change 
   to the confidentiality and scaling assumptions surrounding the use of 
   ASes in the Internet. In particular, this document is conformant to 
   the requirements set out in [INTER-AS-TE-REQ]. 

   The following features are explicitly excluded: 

     o  There is no attempt to distribute TE information from within one 
        AS to another AS. 

     o  There is no mechanism proposed to distribute any form of TE 
        reachability information for destinations outside the AS. 

     o  There is no proposed change to the PCE architecture or usage. 

     o  TE aggregation is not supported or recommended. 

     o  There is no exchange of private information between ASes. 

     o  No ISIS adjacencies are formed on the inter-AS link. 

    

2.2. Per-Domain Path Determination 

   In the per-domain method of determining an inter-AS path for an MPLS-
   TE LSP, when an LSR that is an entry-point to an AS receives a PATH 
   message from an upstream AS with an ERO containing a next hop that is 
   an AS number, it needs to find which LSRs (ASBRs) within the local AS 
   are connected to the downstream AS so that it can compute a TE LSP 
   segment across the AS to one of those LSRs and forward the PATH 
   message to it and hence into the next AS. See Figure 1 for an 
   example : 



 
 
Mach, et al.           Expires August 3, 2008                 [Page 4] 

Internet-Draft     ISIS extensions for Inter-AS TE       February 2008 
    

                R1------R3----R5-----R7------R9-----R11 
                        |     | \    |      / | 
                        |     |  \   |  ----  | 
                        |     |   \  | /      | 
                R2------R4----R6   --R8------R10----R12 
                           :              : 
                <-- AS1 -->:<---- AS2 --->:<--- AS3 ---> 
    
                  Figure 1: Inter-AS Reference Model 

   The figure shows three ASes (AS1, AS2, and AS3) and twelve LSRs (R1 
   through R12). R3 and R4 are ASBRs in AS1. R5, R6, R7, and R8 are 
   ASBRs in AS2. R9 and R10 are ASBRs in AS3. 

   If it is planned to establish an inter-AS TE LSP from R1 to R12, the 
   AS sequence will be: AS1, AS2, AS3. 

   Suppose that the Path message enters AS2 from R3. The next hop in the 
   ERO shows AS3, and R5 must determine a path segment across AS2 to 
   reach AS3. It has a choice of three exit points from AS2 (R6, R7, and 
   R8) and it needs to know which of these provide TE connectivity to 
   AS3, and whether the TE connectivity (for example, available 
   bandwidth) is adequate for the requested LSP. 

   Alternatively, if the next hop in the ERO is the entry ASBR for AS3 
   (say R9), R5 needs to know which of its exit ASBRs has a TE link that 
   connects to R9. Since there may be multiple ASBRs that are connected 
   to R9 (both R7 and R8 in this example), R5 also needs to know the TE 
   properties of the inter-AS TE links so that it can select the correct 
   exit ASBR. 

   Once the path message reaches the exit ASBR, any choice of inter-AS 
   TE link can be made by the ASBR if not already made by entry ASBR 
   that computed the segment. 

   More details can be found in the Section 4.0 of [PD-PATH], which 
   clearly points out why advertising of inter-AS links is desired. 

   To enable R5 to make the correct choice of exit ASBR the following 
   information is needed: 

     o  List of all inter-AS TE links for the local AS. 

     o  TE properties of each inter-AS TE link. 

     o  AS number of the neighboring AS connected to by each inter-AS TE 
        link. 
 
 
Mach, et al.           Expires August 3, 2008                 [Page 5] 

Internet-Draft     ISIS extensions for Inter-AS TE       February 2008 
    

     o  Identity (TE Router ID) of the neighboring ASBR connected to by 
        each inter-AS TE link. 

   In GMPLS networks further information may also be required to select 
   the correct TE links as defined in [GMPLS-TE]. 

   The example above shows how this information is needed at the entry 
   point ASBRs for each AS (or the PCEs that provide computation 
   services for the ASBRs), but this information is also needed 
   throughout the local AS if path computation function is fully 
   distributed among LSRs in the local AS, for example to support LSPs 
   that have start points (ingress nodes) within the AS.  

2.3. Backward Recursive Path Computation 

   Another scenario using PCE techniques has the same problem. [BRPC] 
   defines a PCE-based TE LSP computation method (called Backward 
   Recursive Path Computation) to compute optimal inter-domain 
   constrained MPLS-TE or GMPLS LSPs. In this path computation method, a 
   specific set of traversed domains (ASes) are assumed to be selected 
   before computation starts. Each downstream PCE in domain(i) returns 
   to its upstream neighbor PCE in domain(i-1) a multipoint-to-point 
   tree of potential paths. Each tree consists of the set of paths from 
   all Boundary Nodes located in domain(i) to the destination where each 
   path satisfies the set of required constraints for the TE LSP 
   (bandwidth, affinities, etc.).  

   So a PCE needs to select Boundary Nodes (that is, ASBRs) that provide 
   connectivity from the upstream AS. In order that the tree of paths 
   provided by one PCE to its neighbor can be correlated, the identities 
   of the ASBRs for each path need to be referenced, so the PCE must 
   know the identities of the ASBRs in the remote AS reached by any 
   inter-AS TE link, and, in order that it provides only suitable paths 
   in the tree, the PCE must know the TE properties of the inter-AS TE 
   links. See the following figure as an example: 











 
 
Mach, et al.           Expires August 3, 2008                 [Page 6] 

Internet-Draft     ISIS extensions for Inter-AS TE       February 2008 
    

                   PCE1<------>PCE2<-------->PCE3 
                   /       :             : 
                  /        :             : 
                R1------R3----R5-----R7------R9-----R11 
                        |     | \    |      / | 
                        |     |  \   |  ----  | 
                        |     |   \  | /      | 
                R2------R4----R6   --R8------R10----R12 
                           :              : 
                <-- AS1 -->:<---- AS2 --->:<--- AS3 ---> 
    
            Figure 2: BRPC for Inter-AS Reference Model 

   The figure shows three ASes (AS1, AS2, and AS3), three PCEs(PCE1, 
   PCE2, and PCE3) and twelve LSRs (R1 through R12). R3 and R4 are ASBRs 
   in AS1. R5, R6, R7, and R8 are ASBRs in AS2. R9 and R10 are ASBRs in 
   AS3. PCE1, PCE2, and PCE3 cooperate to perform inter-AS path 
   computation and are responsible for path segment computation within 
   their own domains.  

   If it is planned to establish an inter-AS TE LSP from R1 to R12, the 
   traversed domains are assumed to be selected: AS1->AS2->AS3, and the 
   PCE chain is: PCE1->PCE2->PCE3. First, the path computation request 
   originated from the PCC (R1) is relayed by PCE1 and PCE2 along the 
   PCE chain to PCE3, then PCE3 begins to compute the path segments from 
   the entry boundary nodes that provide connection from AS2 to the 
   destination (R12). But, to provide suitable path segments, PCE3 must 
   determine which entry boundary nodes provide connectivity to its 
   upstream neighbor AS (identified by its AS number), and must know the 
   TE properties of the inter-AS TE links. In the same way, PCE2 also 
   needs to determine the entry boundary nodes according to its upstream 
   neighbor AS and the inter-AS TE link capabilities. 

   Thus, to support Backward Recursive Path Computation the same 
   information listed in Section 2.2 is required. 

3. Extensions to ISIS-TE 

   Note that this document does not define mechanisms for distribution 
   of TE information from one AS to another, does not distribute any 
   form of TE reachability information for destinations outside the AS, 
   does not change the PCE architecture or usage, does not suggest or 
   recommend any form of TE aggregation, and does not feed private 
   information between ASes. See Section 2.1. 

   In this document, for the advertisement of inter-AS TE links, a new 
   TLV, which is referred to as the Inter-AS Reachability TLV, is 
 
 
Mach, et al.           Expires August 3, 2008                 [Page 7] 

Internet-Draft     ISIS extensions for Inter-AS TE       February 2008 
    

   defined and three new sub-TLVs are defined for inclusion in the 
   Inter-AS Reachability TLV to carry the information about the 
   neighboring AS number and the remote ASBR ID of an inter-AS link. The 
   sub-TLVs defined in [ISIS-TE], [ISIS-TE-V3] and other documents for 
   inclusion in the Extended IS Reachability TLV are applicable to be 
   included in the Inter-AS Reachability TLV for inter-AS TE links 
   advertisement. And another two new sub-TLVs are defined for inclusion 
   in the IS-IS Router Capability TLV to carry the TE Router ID when the 
   TE Router ID is needed to reach all routers within an entire ISIS 
   routing domain. 

3.1. Inter-AS Reachability TLV 

   The Inter-AS Reachability TLV has type 141 (which needs to be 
   confirmed by IANA), it contains a data structure consisting of: 

      7 octets of System ID and Pseudonode Number 
      3 octets of default metric 
      1 octet of control information, consisting of: 
         1 bit of flooding-scope information 
         1 bit of up/down information 
         6 bits reserved 
      1 octet of length of sub-TLVs 
      0-243 octets of sub-TLVs 
         where each sub-TLV consists of a sequence of: 
           1 octet of sub-type 
           1 octet of length of the value field of the sub-TLV 
           0-241 octets of value 
    
   Compare to the Extended Reachability TLV which is defined in [ISIS-
   TE], the Inter-AS Reachability TLV introduces an extra "control 
   information" field which is consisted of a flooding-scope bit, a 
   up/down bit and 6 reserved bits. 

   As the S bit defined in [ISIS-CAP], the flooding-scope bit is used to 
   control the flooding scope of the Inter-AS Reachability TLV. When the 
   flooding-scope bit is set to 1, the Inter-AS Reachability TLV MUST be 
   flooded into the entire ISIS routing domain. If the flooding-scope 
   bit is set to 0, the Inter-AS Reachability TLV MUST NOT be leaked 
   between different levels. And this flooding-scope bit MUST NOT be 
   modified during the TLV leaking. The choice between the use of 0 or 1 
   is a network-wide policy choice, and configuration control SHOULD be 
   provided in ASBR implementations that supports the advertisement of 
   inter-AS TE links. 

   The semantics of the up/down bit in the Inter-AS Reachability TLV are 
   identical to the semantics of the up/down bit defined in [ISIS-TE]. 
 
 
Mach, et al.           Expires August 3, 2008                 [Page 8] 

Internet-Draft     ISIS extensions for Inter-AS TE       February 2008 
    

   It can be used to facilitate the redistribution of inter-AS TE 
   information freely between level 1 and level 2. And the up/down bit 
   MUST be set to 0 when the Inter-AS TE information first injected into 
   ISIS [ISIS], and the up/dawn bit MUST be set to 1 if the Inter-AS TE 
   information needs to be advertised from high level to low level. 

   The sub-TLVs which are defined in [ISIS-TE], [ISIS-TE-V3] and other 
   documents for describing the TE properties of an TE link are also 
   applicable to be carried in the Inter-AS Reachability TLV to describe 
   the TE properties of an Inter-AS TE link. Apart from these sub-TLVs, 
   three new sub-TLVs are defined for inclusion in the Inter-AS 
   Reachability TLV in the document: 

   Sub-TLV type   Length  Name 
   ------------    ------  --------------------------- 
             23        4   Remote AS number 
             24        4   IPv4 Remote ASBR Identifier 
             25       16   IPv6 Remote ASBR Identifier 
              
   The detailed definitions of the three new sub-TLVs are described in 
   Section 3.3. 

3.2. TE Router ID 

   The IPv4 TE Router ID TLV (type 134) and IPv6 TE Router ID TLV (type 
   140), which are defined in [ISIS-TE] and [ISIS-TE-V3] respectively, 
   only have area flooding-scope, when performing inter-AS TE, the TE 
   Router ID MAY be needed to reach all routers within an entire ISIS 
   routing domain, and it MUST have the same flooding scope as the 
   Inter-AS Reachability TLV does. 

   [ISIS-CAP] defines a generic advertisement mechanism for ISIS which 
   allows a router to advertise its capabilities within an ISIS area or 
   an entire ISIS routing domain. And [ISIS-CAP] also points out that TE 
   Router ID is candidate to be carried in the IS-IS Router Capability 
   TLV when performing inter-area TE. 

   This document uses such mechanism for TE Router ID advertisement when 
   the TE Router ID is needed to reach all routers within an entire ISIS 
   Routing domain. Two new sub-TLVs are defined for inclusion in the IS-
   IS Router Capability TLV to carry the IPv4 and IPv6 TE Router ID 
   respectively:  





 
 
Mach, et al.           Expires August 3, 2008                 [Page 9] 

Internet-Draft     ISIS extensions for Inter-AS TE       February 2008 
    

   Sub-TLV type   Length  Name 
   ------------    ------  ----------------- 
             11        4   IPv4 TE Router ID 
             12       16   IPv6 TE Router ID 
    

   The Detailed definitions of the two new sub-TLVs are described in 
   Section 3.3. 

3.3. Sub-TLV Detail 

3.3.1. Remote AS Number Sub-TLV 

   A new sub-TLV, the Remote AS Number sub-TLV is defined for inclusion 
   in the Inter-AS Reachability TLV when advertising inter-AS links. The 
   Remote AS Number sub-TLV specifies the AS number of the neighboring 
   AS to which the advertised link connects. 

   The Remote AS number sub-TLV is TLV type 23 (which needs to be 
   confirmed by IANA), and is four octets in length. The format is as 
   follows: 

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |              Type             |             Length            | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                       Remote AS Number                        | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
   The Remote AS number field has 4 octets. When only two octets are 
   used for the AS number, as in current deployments, the left (high-
   order) two octets MUST be set to zero. The Remote AS Number Sub-TLV 
   MUST be included when a router advertises an inter-AS TE link. 

3.3.2. IPv4 Remote ASBR ID Sub-TLV 

   A new sub-TLV, which is referred to as the IPv4 Remote ASBR ID sub-
   TLV, is defined for inclusion in the Inter-AS Reachability TLV when 
   advertising inter-AS links. The IPv4 Remote ASBR ID sub-TLV specifies 
   the IPv4 identifier of the remote ASBR to which the advertised inter-
   AS link connects. This could be any stable and routable IPv4 address 
   of the remote ASBR. Use of the TE Router ID is RECOMMENDED. 

   The IPv4 Remote ASBR ID sub-TLV is TLV type 24 (which needs to be 
   confirmed by IANA), and is four octets in length. The format of the 
   IPv4 Remote ASBR ID sub-TLV is as follows: 
 
 
Mach, et al.           Expires August 3, 2008                [Page 10] 

Internet-Draft     ISIS extensions for Inter-AS TE       February 2008 
    

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |              Type             |             Length            | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                       Remote ASBR ID                          | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
   The IPv4 Remote ASBR ID sub-TLV MUST be included if the neighboring 
   ASBR has an IPv4 address. If the neighboring ASBR does not have an 
   IPv4 address (not even an IPv4 TE Router ID), the IPv6 Remote ASBR ID 
   sub-TLV MUST be included instead. An IPv4 Remote ASBR ID sub-TLV and 
   IPv6 Remote ASBR ID sub-TLV MAY both be present in an Extended IS 
   Reachability TLV. 

3.3.3. IPv6 Remote ASBR ID Sub-TLV 

   A new sub-TLV, which is referred to as the IPv6 Remote ASBR ID sub-
   TLV, is defined for inclusion in the Inter-AS Reachability TLV when 
   advertising inter-AS links. The IPv6 Remote ASBR ID sub-TLV specifies 
   the IPv6 identifier of the remote ASBR to which the advertised inter-
   AS link connects. This could be any stable and routable IPv6 address 
   of the remote ASBR. Use of the TE Router ID is RECOMMENDED. 

   The IPv6 Remote ASBR ID sub-TLV is TLV type 25 (which needs to be 
   confirmed by IANA), and is sixteen octets in length. The format of 
   the IPv6 Remote ASBR ID sub-TLV is as follows: 

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |              Type             |             Length            | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  
   |                       Remote ASBR ID                          | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                       Remote ASBR ID (continued)              | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                       Remote ASBR ID (continued)              | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                       Remote ASBR ID (continued)              | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
   The IPv6 Remote ASBR ID sub-TLV MUST be included if the neighboring 
   ASBR has an IPv6 address. If the neighboring ASBR does not have an 
   IPv6 address, the IPv4 Remote ASBR ID sub-TLV MUST be included 
   instead. An IPv4 Remote ASBR ID sub-TLV and IPv6 Remote ASBR ID sub-
   TLV MAY both be present in an Extended IS Reachability TLV. 
 
 
Mach, et al.           Expires August 3, 2008                [Page 11] 

Internet-Draft     ISIS extensions for Inter-AS TE       February 2008 
    

3.3.4. IPv4 TE Router ID sub-TLV 

   The IPv4 TE Router ID sub-TLV is TLV type 11 (which needs to be 
   confirmed by IANA), and is four octets in length. The format of the 
   IPv4 TE Router ID sub-TLV is as follows: 

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |              Type             |             Length            | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                       TE Router ID                            | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
   When the TE Router ID is needed to reach all routers within an entire 
   ISIS routing domain, the IS-IS Router Capability TLV MUST be included 
   in its LSP. And if an ASBR supports Traffic Engineering for IPv4, the 
   IPv4 TE Router ID sub-TLV MUST be included if the ASBR has an IPv4 TE 
   Router ID. If the ASBR does not have an IPv4 TE Router ID, the IPv6 
   TE Router sub-TLV MUST be included instead. An IPv4 TE Router ID sub-
   TLV and IPv6 TE Router ID sub-TLV MAY both be present in an IS-IS 
   Router Capability TLV.  

3.3.5. IPv6 TE Router ID sub-TLV 

   The IPv6 TE Router ID sub-TLV is TLV type 12 (which needs to be 
   confirmed by IANA), and is four octets in length. The format of the 
   IPv6 TE Router ID sub-TLV is as follows: 

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |              Type             |             Length            | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  
   |                       TE Router ID                            | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                       TE Router ID   (continued)              | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                       TE Router ID   (continued)              | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                       TE Router ID   (continued)              | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
   When the TE Router ID is needed to reach all routers within an entire 
   ISIS routing domain, the IS-IS Router Capability TLV MUST be included 
   in its LSP. And if an ASBR supports Traffic Engineering for IPv6, the 
   IPv6 TE Router ID sub-TLV MUST be included if the ASBR has an IPv6 TE 
 
 
Mach, et al.           Expires August 3, 2008                [Page 12] 

Internet-Draft     ISIS extensions for Inter-AS TE       February 2008 
    

   Router ID. If the ASBR does not have an IPv6 TE Router ID, the IPv4 
   TE Router sub-TLV MUST be included instead. An IPv4 TE Router ID sub-
   TLV and IPv6 TE Router ID sub-TLV MAY both be present in an IS-IS 
   Router Capability TLV. 

4. Procedure for Inter-AS TE Links 

   When TE is enabled on an inter-AS link and the link is up, the ASBR 
   SHOULD advertise this link using the normal procedures for ISIS-TE 
   [ISIS-TE]. When either the link is down or TE is disabled on the link, 
   the ASBR SHOULD withdraw the advertisement. When there are changes to 
   the TE parameters for the link (for example, when the available 
   bandwidth changes) the ASBR SHOULD re-advertise the link, but the 
   ASBR MUST take precautions against excessive re-advertisements.  

   Hellos MUST NOT be exchanged over the inter-AS link, and consequently, 
   an ISIS adjacency MUST NOT be formed. 

   The information advertised comes from the ASBR's knowledge of the TE 
   capabilities of the link, the ASBR's knowledge of the current status 
   and usage of the link, and configuration at the ASBR of the remote AS 
   number and remote ASBR TE Router ID. 

   Legacy routers receiving an advertisement for an inter-AS TE link are 
   able to ignore it because they do not know the new TLV and sub-TLVs 
   that are defined in Section 3 in this document. They will continue to 
   flood the LSP, but will not attempt to use the information received. 

   In the current operation of ISIS TE the LSRs at each end of a TE link 
   emit LSAs describing the link. The databases in the LSRs then have 
   two entries (one locally generated, the other from the peer) that 
   describe the different 'directions' of the link.  This enables CSPF 
   to do a two-way check on the link when performing path computation 
   and eliminate it from consideration unless both directions of the 
   link satisfy the required constraints. 

   In the case we are considering here (i.e., of a TE link to another AS) 
   there is, by definition, no IGP peering and hence no bi-directional 
   TE link information. In order for the CSPF route computation entity 
   to include the link as a candidate path, we have to find a way to get 
   LSAs describing its (bidirectional) TE properties into the TE 
   database. 

   This is achieved by the ASBR advertising, internally to its AS, 
   information about both directions of the TE link to the next AS. The 
   ASBR will normally generate a LSA describing its own side of a link; 
   here we have it 'proxy' for the ASBR at the edge of the other AS and 
 
 
Mach, et al.           Expires August 3, 2008                [Page 13] 

Internet-Draft     ISIS extensions for Inter-AS TE       February 2008 
    

   generate an additional LSA that describes that devices 'view' of the 
   link. 

   Only some essential TE information for the link needs to be 
   advertised; i.e., the Interface Address, the Remote AS number and the 
   Remote ASBR ID of an inter-AS TE link. 

   Routers or PCEs that are capable of processing advertisements of 
   inter-AS TE links SHOULD NOT use such links to compute paths that 
   exit an AS to a remote ASBR and then immediately re-enter the AS 
   through another TE link. Such paths would constitute extremely rare 
   occurrences and SHOULD NOT be allowed except as the result of 
   specific policy configurations at the router or PCE computing the 
   path. 

4.1. Origin of Proxied TE Information 

   Section 4 describes how to an ASBR advertises TE link information as 
   a proxy for its neighbor ASBR, but does not describe where this 
   information comes from.  

   Although the source of this information is outside the scope of this 
   document, it is possible that it will be a configuration requirement 
   at the ASBR, as are other, local, properties of the TE link. Further, 
   where BGP is used to exchange IP routing information between the 
   ASBRs, a certain amount of additional local configuration about the 
   link and the remote ASBR is likely to be available. 

   We note further that it is possible, and may be operationally 
   advantageous, to obtain some of the required configuration 
   information from BGP. Whether and how to utilize these possibilities 
   is an implementation matter. 

5. Security Considerations 

   The protocol extensions defined in this document are relatively minor 
   and can be secured within the AS in which they are used by the 
   existing ISIS security mechanisms. 

   There is no exchange of information between ASes, and no change to 
   the ISIS security relationship between the ASes. In particular, since 
   no ISIS adjacency is formed on the inter-AS links, there is no 
   requirement for ISIS security between the ASes. 

   Some of the information included in these new advertisements (e.g., 
   the remote AS number and the remote ASBR ID) is obtained manually 
   from a neighboring administration as part of commercial relationship. 
 
 
Mach, et al.           Expires August 3, 2008                [Page 14] 

Internet-Draft     ISIS extensions for Inter-AS TE       February 2008 
    

   The source and content of this information should be carefully 
   checked before it is entered as configuration information at the ASBR 
   responsible for advertising the inter-AS TE links.  

   It is worth noting that in the scenario we are considering a Border 
   Gateway Protocol (BGP) peering may exist between the two ASBRs and 
   this could be used to detect inconsistencies in configuration. For 
   example, if a different remote AS number is received in a BGP OPEN 
   [BGP] from that locally configured into ISIS-TE, as we describe here, 
   then something is amiss. Note, further, that if BGP is used to 
   exchange TE information as described in Section 4.1, the inter-AS BGP 
   session will need to be fully secured. 

6. IANA Considerations 

   IANA is requested to make the following allocations from registries 
   under its control. 

6.1. Inter-AS Reachability TLV 

   This document defines the following new ISIS TLV type, described in 
   Section 3.4, that needs to be registered in the ISIS TLV code-point 
   registry: 

              Type        Description              IIH   LSP   SNP 
              ----        ----------------------   ---   ---   --- 
               141        Inter-AS reachability     n     y     n 
                                information 
    

6.2. Sub-TLVs for the Inter-AS Reachability TLV 

   This document defines the following new sub-TLV types, described in 
   Sections 3.3.1, 3.3.2 and 3.3.3, of top-level TLV 141 (see section 
   6.1 above) that need to be registered in the ISIS sub-TLV registry 
   for TLV 141: 

      Type        Description                        Length 
      ----        ------------------------------   -------- 
        23        Remote AS number                        4 
        24        IPv4 Remote ASBR Identifier             4 
        25        IPv6 Remote ASBR Identifier            16 
    
   As described above in Section 3.1, the sub-TLVs which are defined in 
   [ISIS-TE], [ISIS-TE-V3] and other documents for describing the TE 
   properties of an TE link are applicable to describe an inter-AS TE 
   link and MAY be included in the Inter-AS Reachability TLV when 
 
 
Mach, et al.           Expires August 3, 2008                [Page 15] 

Internet-Draft     ISIS extensions for Inter-AS TE       February 2008 
    

   adverting inter-AS TE links. So, these sub-TLVs need to be registered 
   in the ISIS sub-TLV registry for TLV 141. And in order to simplify 
   the registration, we suggest using the same registry value as they 
   are registered in the ISIS sub-TLV registry for TLV 22. 

6.3. Sub-TLVs for the IS-IS Router Capability TLV 

   This document defines the following new sub-TLV types, described in 
   Sections 3.3.4 and 3.3.5, of top-level TLV 242 (which is defined in 
   [ISIS-CAP]) that need to be registered in the ISIS sub-TLV registry 
   for TLV 242: 

      Type        Description                        Length 
      ----        ------------------------------   -------- 
        11        IPv4 TE Router ID                       4 
        12        IPv6 TE Router ID                      16 
      

7. Acknowledgments 

   The authors would like to thank Adrian Farrel, Jean-Louis Le Roux, 
   Christian Hopps, and Les Ginsberg for their review and comments on 
   this document. 

8. References 

8.1. Normative References 

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate 
             Requirement Levels", BCP 14, RFC 2119, March 1997. 

   [RFC3209]  Awduche, D., Berger, L., Gan, D., Li, T., Srinivasan, V., 
             and G. Swallow, "RSVP-TE: Extensions to RSVP for LSP 
             Tunnels", RFC 3209, December 2001. 

   [ISIS]  Callon, R., "Use of OSI IS-IS for routing in TCP/IP and              
             dual environments", RFC 1195, December 1990. 

   [ISIS-TE] Smit, H. and T. Li, "Intermediate System to Intermediate           
             System (IS-IS) Extensions for Traffic Engineering (TE)",           
             draft-ietf-isis-te-bis-00.txt, {work in progress}. 

   [ISIS-TE-V3] Harrison, J., Berger, J., and Bartlett, M., "IPv6 
             Traffic Engineering in IS-IS", draft-ietf-isis-ipv6-te, 
             {work in progress}. 


 
 
Mach, et al.           Expires August 3, 2008                [Page 16] 

Internet-Draft     ISIS extensions for Inter-AS TE       February 2008 
    

   [ISIS-CAP] Vasseur, J.P. et al., "IS-IS extensions for advertising 
             router information", RFC 4971, July 2007. 

8.2. Informative References 

   [INTER-AS-TE-REQ] Zhang and Vasseur, "MPLS Inter-AS Traffic 
             Engineering Requirements", RFC4216, November 2005. 

   [PD-PATH] Ayyangar, A., Vasseur, JP., and Zhang, R., "A Per-domain 
             path computation method for establishing Inter-domain", 
             draft-ietf-ccamp-inter-domain-pd-path-comp, (work in 
             progress). 

   [BRPC] JP. Vasseur, Ed., R. Zhang, N. Bitar, JL. Le Roux, "A Backward 
             Recursive PCE-based Computation (BRPC) procedure to compute 
             shortest inter-domain Traffic Engineering Label Switched 
             Paths ", draft-ietf-pce-brpc, (work in progress) 

   [PCE] Farrel, A., Vasseur, JP., and Ash, J., "A Path Computation 
             Element (PCE)-Based Architecture", RFC4655, August 2006. 

   [GMPLS-TE] K.Kompella and Y.Rekhter, "IS-IS Extensions in Support of         
             Generalized Multi-Protocol Label Switching", RFC 4205,             
             October 2005. 

   [BGP] Rekhter, Li, Hares, "A Border Gateway Protocol 4 (BGP-4)", 
             RFC4271, January 2006 

 

















 
 
Mach, et al.           Expires August 3, 2008                [Page 17] 

Internet-Draft     ISIS extensions for Inter-AS TE       February 2008 
    

Authors' Addresses 

   Mach(Guoyi) Chen 
   Huawei Technologies Co.,Ltd 
   KuiKe Building, No.9 Xinxi Rd., 
   Hai-Dian District  
   Beijing, 100085 
   P.R. China 
      
   Email: mach@huawei.com 
    
    
   Renhai Zhang 
   Huawei Technologies Co.,Ltd 
   KuiKe Building, No.9 Xinxi Rd., 
   Hai-Dian District  
   Beijing, 100085 
   P.R. China 
      
   Email: zhangrenhai@huawei.com 
    
    
   Xiaodong Duan 
   China Mobile 
   53A,Xibianmennei Ave,Xunwu District 
   Beijing, China 
      
   Email: duanxiaodong@chinamobile.com 
 

Intellectual Property Statement 

   The IETF takes no position regarding the validity or scope of any 
   Intellectual Property Rights or other rights that might be claimed to 
   pertain to the implementation or use of the technology described in 
   this document or the extent to which any license under such rights 
   might or might not be available; nor does it represent that it has 
   made any independent effort to identify any such rights.  Information 
   on the procedures with respect to rights in RFC documents can be 
   found in BCP 78 and BCP 79. 

   Copies of IPR disclosures made to the IETF Secretariat and any 
   assurances of licenses to be made available, or the result of an 
   attempt made to obtain a general license or permission for the use of 
   such proprietary rights by implementers or users of this 
   specification can be obtained from the IETF on-line IPR repository at 
   http://www.ietf.org/ipr. 
 
 
Mach, et al.           Expires August 3, 2008                [Page 18] 

Internet-Draft     ISIS extensions for Inter-AS TE       February 2008 
    

   The IETF invites any interested party to bring to its attention any 
   copyrights, patents or patent applications, or other proprietary 
   rights that may cover technology that may be required to implement 
   this standard.  Please address the information to the IETF at 
   ietf-ipr@ietf.org. 

Disclaimer of Validity 

   This document and the information contained herein are provided on an 
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS 
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND 
   THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS 
   OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF 
   THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED 
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. 

Copyright Statement 

   Copyright (C) The IETF Trust (2008). 

   This document is subject to the rights, licenses and restrictions 
   contained in BCP 78, and except as set forth therein, the authors 
   retain all their rights. 

    

 



















 
 
Mach, et al.           Expires August 3, 2008                [Page 19] 

